# FabricSheetType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheetType Class
Members See Also
---
Represents a fabric sheet type, used in the generation of fabric wires.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class FabricSheetType : ElementType
```

Visual Basic
---
```text
Public Class FabricSheetType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class FabricSheetType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Structure..::..FabricSheetType
# See Also
FabricSheetType Members
Autodesk.Revit.DB.Structure Namespace